package p65;

/**
 * 24换分币
 * 用一元人民币兑换成1分、2分和5分硬币，共有多少种不同的兑换方法。
 * <p>
 * 运行结果
 * 1:1*0+2*0+5*20  2:1*5+2*0+5*19  3:1*10+2*0+5*18 4:1*15+2*0+5*17
 * 5:1*20+2*0+5*16 6:1*25+2*0+5*15 7:1*30+2*0+5*14 8:1*35+2*0+5*13
 * 9:1*40+2*0+5*12 10:1*45+2*0+5*11 11:1*50+2*0+5*10 12:1*55+2*0+5*9
 * 13:1*60+2*0+5*8 14:1*65+2*0+5*7 15:1*70+2*0+5*6 16:1*75+2*0+5*5
 * 17:1*80+2*0+5*4 18:1*85+2*0+5*3 19:1*90+2*0+5*2 20:1*95+2*0+5*1
 * 21:1*100+2*0+5*0
 */
public class P24Changes {
    public static void main(String[] args) {
        int total = 100;
        int cnt = 0;
        for (int one = 0; one <= total; ++one) {
            for (int two = 0; 2 * two <= total - one; ++two) {
                int odd = total - one - two * 2;
                if (odd % 5 != 0)
                    continue;
                int five = odd / 5;
                System.out.println(String.format("%d:1*%d+2*%d+5*%d", ++cnt, one, two, five));
            }
        }
    }
}
